backend/controllers/SiteController.php

SELECT * FROM `Comment` WHERE `id`='4'
---
    public function actionManagecomments()
    {
        if (Yii::$app->user->identity->type==0)
        {
            return $this->goHome();
        }
        $model = new DeleteCommentForm();

        if ($model->load(Yii::$app->request->post()))
        {
            $id = $model->id;
            $comment = Comment::findOne(['id' => $id]);