common/models/User.php

    public static function findIdentity($account)
    {
        return static::findOne(['account' => $account]);
---
SELECT * FROM `User` WHERE `account`='123456789123456789'