backend/views/site/userinfo.php

SELECT * FROM `User` WHERE `type`=0
---
*/


$user = \common\models\User::findAll(['type' => 0]);